package misssion_algorithms;

public class _basic_info {
	
/*
	1	동적계획법으로문제해결하기
	2	백트래킹알고리즘으로문제해결하기
	3	HeapSort알고리즘구현하기
	4	Heap자료구조구현하기
	5	이진탐색트리구현하기
	6	비선형탐색알고리즘문제해결하기
	7	그래프탐색알고리즘(BFS) 구현하기
	8	그래프 탐색 알고리즘(DFS) 구현하기
	
	9	분할 정복 알고리즘으로 문제 해결하기
	10	투 포인터 알고리즘으로 문제 해결하기
	11	그리디 알고리즘으로 문제 해결하기
	12	계수 정렬 알고리즘 구현하기
	13	병합 정렬 알고리즘 구현하기
	
	14	퀵 정렬 알고리즘 구현하기
	15	선택 정렬 알고리즘 구현하기
	16	삽입 정렬 알고리즘 구현하기
	17	버블 정렬 알고리즘 구현하기
	
	18	재귀 함수로 이진 트리 순회하기
	19	재귀 함수로 피보나치 수열 구현하기
	20	재귀 함수로 팩토리얼 구현하기
	
	21	이진 탐색 알고리즘 구현하기
	22	완전 탐색 알고리즘 구현하기
	23	선형 탐색 알고리즘 구현하기
	
	24	Stack/Queue/Deque 구현하기
	25	Set을사용하여 중복데이터제거하기
	26	Map을사용하여 키-값 쌍관리하기
	27	컬렉션 프레임워크활용하여문제 해결하기
	28	Stream을사용하여 List요소합계 구하기
	
	29	List에서최대값 인덱스찾기
	30	재귀 함수를이용한피보나치수열구현하기
	31	정렬알고리즘(버블정렬,선택정렬등)구현하기
	32	배열에서 최대값찾기알고리즘구현하기
*/	

}
